Revit 2027 API
BuiltInFailures.StairRampFailures.TreadDepthFailsEq Property
 The actual tread depth and riser height for one or more stairs of this type violates the stair equation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TreadDepthFailsEq { get; }
Public Shared ReadOnly Property TreadDepthFailsEq As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TreadDepthFailsEq {
	FailureDefinitionId^ get ();
}
static member TreadDepthFailsEq : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace